#+title: Using Github CLI
#+subtitle: Maybe it's faster, lets see
#+tags[]: github git
#+date: 2024-07-29T17:51:21
#+draft: true

First install:

#+begin_src bash
  brew install gh
#+end_src

* Login

#+begin_src bash
  gh auth login
#+end_src

This takes you through a web login flow so your computer is
authorized.

#+begin_src bash :results output
  gh auth status
#+end_src

#+RESULTS:
: github.com
:   ✓ Logged in to github.com account wschenk (keyring)
:   - Active account: true
:   - Git operations protocol: https
:   - Token: gho_************************************
:   - Token scopes: 'gist', 'read:org', 'repo', 'workflow'

* Create a repo

#+begin_src bash
  gh repo create
#+end_src

This will walk you through the options of creating a repo.

* Setting description

#+begin_src bash
  gh repo edit -d "Playground to see about setting up actions to monitor thing"
#+end_src

* Open it up

So far this is my most used command:

#+begin_src bash
  gh browse
#+end_src

* Workflows

#+begin_src bash
  gh workflow list
#+end_src

#+begin_src bash
  gh run list
#+end_src

#+begin_src bash
  gh run view
#+end_src

* Publishing a side on gh pages

#+begin_src bash
  # Create the remote repo
  gh repo create

  # Create the local repository
  git init

  # Add things to .gitignore if you haven't

  # Add the remote
  git add origin remote https://github.com/wschenk/thefocus-landing

  # Add everything
  git add .

  # Create a commit
  git commit -m "Initial import"

  # Make sure the buffer is big enough if its complaining
  git config --global http.postBuffer 524288000

  # Open up the page on github
  gh browser
#+end_src

Once you are there, click on the settings, and then =Pages=
on the left navigation.  If that works, then you can select
deploy from branch =main= if you doing a static site that you
build locally.

** Setting up a domain

If you want to have everything on a domain, you first need to get the domain
and figure out where you want to host the records.

If you are setting up the main "apex" domain, these are the IP addresses
you point the A records to

#+begin_src bash
185.199.108.153
185.199.109.153
185.199.110.153
185.199.111.153
#+end_src

[[https://docs.github.com/en/pages/configuring-a-custom-domain-for-your-github-pages-site/managing-a-custom-domain-for-your-github-pages-site#configuring-an-apex-domain][More information here]].



